{
  "artworks": [
    {
      "filename": "charango.png",
      "title": "Charango",
      "description": "This is a charango, a small stringed instrument native to the Andes. My grandpa, who lived in Jujuy, a province in the northern part of Argentina, gave this to me in 2025. It was created by the indigenous people of the area, the Quechua, in the 18th century post Spanish colonization."
    },
    {
      "filename": "big_art.png",
      "title": "Homage a Picasso",
      "description": "This artwork is by [Orlando Diaz](https://www.puntoactual.com/orlandodiaz?lang=en). This is the first framed artwork I ever bought back in 2021, and I love its use of color and the postmodern homage to Picasso. In my mind, it's a queen finding peace in chaos. Unfortunately, since I bought it at a used local auction house, I have no idea what the original story is behind it or what the intent of the artist was, and I have not been able to track him down. Guests have said it looks like the queen of hearts, like Jesus Christ prior to his crucifixion with the crown of thorns, and, of course, \"like a Picasso.\""
    },
    {
      "filename": "moon_goddess.png",
      "title": "Moon Goddess",
      "description": "Erwin Binder (American, 1934-1993), \"Moon Goddess,\" 1984, cast paper relief."
    },
    {
      "filename": "independence_hall.png",
      "title": "Independence Hall",
      "description": "This early 20th century etching of Independence Hall in Pennsylvania is by [Anton Schutz](https://oldprintshop.com/artists/426)."
    },
    {
      "filename": "capitol.png",
      "title": "Washington, The Capitol",
      "description": "This early 20th century etching of the Capitol building in Washington D.C. is by [Anton Schutz](https://oldprintshop.com/artists/426)."
    },
    {
      "filename": "?.png",
      "title": "?",
      "description": "This early 20th century etching of the Capitol building in Washington D.C. is by [Anton Schutz](https://oldprintshop.com/artists/426)."
    },
    {
      "filename": "?.png",
      "title": "New Yorker Cover",
      "description": "I don't read the New Yorker, but this was $5 with the frame included and it looks really nice."
    },
    {
      "filename": "new_yorker.png",
      "title": "View of the World from 9th Avenue",
      "description": "Perception based map humor. As a girl born in Manhattan and raised elsewhere, the self importance of New Yorkers hasn't changed a bit in the last fifty years! Also, this was $5!"
    } 
  ]
}